Repository: shamshod8052/biology_test_bot
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Personal info
uz: Shaxsiy ma'lumotlar

source: Permissions
uz: Ruxsatlar

source: Important dates
uz: Muhim sanalar

source: ✅ Active
uz: ✅ Faol

source: 🚫 Blocked the bot
uz: 🚫 Botni bloklagan

source: 🔴 Telegram Not Found
uz: 🔴 Telegram topilmadi

source: ⛔️ Blocked
uz: ⛔️ Bloklangan

source: ❗️ Failed
uz: ❗️ Muvaffaqiyatsiz

source: Phone
uz: Telefon

source: Password
uz: Parol

source: First name
uz: Ism

source: Last name
uz: Familiya

source: Username
uz: Foydalanuvchi nomi

source: staff status
uz: xodim maqomi

source: Designates whether the user can log into this admin site.
uz: Foydalanuvchi admin sahifasiga kira olishini belgilaydi.

source: active
uz: faol

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
uz: Foydalanuvchi faol sifatida qabul qilinishini belgilaydi. Hisobni o‘chirish o‘rniga bu belgini olib tashlang.

source: date joined
uz: ro‘yxatdan o‘tgan sana

source: User
uz: Foydalanuvchi

source: Users
uz: Foydalanuvchilar

source: Name
uz: Nomi

source: Is active
uz: Faolmi

source: Channel
uz: Kanal

source: Channels
uz: Kanallar

source: The test is not available!
uz: Test mavjud emas!

source: Text
uz: Matn

source: Diagnostic test
uz: Diagnostik test

source: Diagnostic tests
uz: Diagnostik testlar

source: Course
uz: Kurs

source: Courses
uz: Kurslar

source: Test analyse video
uz: Test tahlil videosi

source: Test analyse videos
uz: Test tahlil videolari

source: Answer
uz: Javob

source: Answers
uz: Javoblar

source: User answer
uz: Foydalanuvchi javobi

source: User answers
uz: Foydalanuvchi javoblari

source: Result
uz: Natija

source: View answers
uz: Javoblarni ko‘rish

source: Answers Text
uz: Javoblar matni

source: About
uz: Haqida

source: Not set
uz: Belgilanmagan

source: Attestation
uz: Attestatsiya

source: Certificate
uz: Sertifikat

source: Overall result
uz: Umumiy natija

source: Correct answers number
uz: To‘g‘ri javoblar soni

source: Only selected answers
uz: Faqat tanlangan javoblar

source: File
uz: Fayl

source: Telegram File ID
uz: Telegram fayl ID raqami

source: Saved File Path
uz: Saqlangan fayl manzili

source: Description
uz: Tavsif

source: This text will contain information about the test.
uz: Bu matnda test haqidagi ma’lumotlar bo‘ladi.

source: Select the result display mode?
uz: Natijani ko‘rsatish usulini tanlang?

source: Started at
uz: Boshlangan vaqti

source: Ends at
uz: Tugash vaqti

source: Active
uz: Faol

source: Status
uz: Holati

source: Created at
uz: Yaratilgan vaqti

source: Updated at
uz: Yangilangan vaqti

source: Started at:
uz: Boshlangan vaqti:

source: Ends at:
uz: Tugash vaqti:

source: Not enough answers!
uz: Javoblar yetarli emas!

source: Open
uz: Ochiq

source: Close
uz: Yopiq

source: Type
uz: Turi

source: Value
uz: Qiymat

source: Answers text
uz: Javoblar matni

source: Your result:
uz: Sizning natijangiz:

source: Your answers:
uz: Sizning javoblaringiz:

source: Not found!
uz: Topilmadi!

source: Course information is not available!
uz: Kurs haqida ma'lumot mavjud emas!

source: About the course
uz: Kurs haqida

source: Channel name
uz: Kanal nomi

source: Channel username
uz: Kanal foydalanuvchi nomi

source: Example: https://t.me/username
uz: Misol: https://t.me/username

source: Lesson name
uz: Dars nomi

source: Video file
uz: Video fayl

source: File ID
uz: Fayl ID

source: Protect content
uz: Kontentni himoya qilish

source: Video lesson
uz: Video dars

source: Video lessons
uz: Video darslar

source: Title name
uz: Sarlavha nomi

source: Title
uz: Sarlavha

source: Titles
uz: Sarlavhalar

source: Quiz
uz: Test

source: Inline
uz: Inline (ichki)

source: Question type
uz: Savol turi

source: Test title
uz: Test sarlavhasi

source: Test name
uz: Test nomi

source: Time limit (sec)
uz: Vaqt chegarasi (soniya)

source: Seconds to answer every quiz
uz: Har bir testga javob berish uchun sekundlar

source: Shuffle questions
uz: Savollarni aralashtirish

source: Show true answer
uz: To‘g‘ri javobni ko‘rsatish

source: ♻️ {topic} 🖊 {quest_num} questions 💬 {test_type} {wait_time_text}🏁 When you're ready, click the button below.
uz: ♻️ {topic} 🖊 {quest_num} ta savol 💬 {test_type} {wait_time_text}🏁 Tayyor bo‘lgach, quyidagi tugmani bosing.

source: Tests
uz: Testlar

source: Question text
uz: Savol matni

source: Seconds to answer quiz
uz: Testga javob berish uchun sekundlar

source: Shuffle answers
uz: Javoblarni aralashtirish

source: Explanation
uz: Tushuntirish

source: Question
uz: Savol

source: Questions
uz: Savollar

source: Time limit required for quiz questions.
uz: Test savollariga ajratilgan vaqt chegarasi.

source: Image
uz: Rasm

source: Telegram file ID
uz: Telegram fayl ID

source: Photo
uz: Foto

source: Photos
uz: Fotolar

source: Option text
uz: Javob matni

source: Is correct option
uz: To‘g‘ri javob

source: Only one correct for quizzes
uz: Testlar uchun faqat bitta to‘g‘ri javob bo‘lishi mumkin

source: Option
uz: Javob

source: Options
uz: Javoblar

source: User chat
uz: Foydalanuvchi chat

source: Language
uz: Til

source: Started
uz: Boshlangan

source: Poll ID
uz: So‘rovnoma ID

source: No remaining questions
uz: Savollar qolmadi

source: Task
uz: Vazifa

source: Tasks
uz: Vazifalar

source: Full name
uz: To‘liq ism

source: Correct
uz: To‘g‘ri

source: Incorrect
uz: Noto‘g‘ri

source: Time spent(s)
uz: Sarflangan vaqt (soniya)

source: Participant
uz: Ishtirokchi

source: Participants
uz: Ishtirokchilar

source: Pending
uz: Kutmoqda

source: Answered
uz: Javob berildi

source: Quest
uz: Savol

source: Quests
uz: Savollar

source: Not available!
uz: Mavjud emas!

source: 🏁 "{topic}" test the end. ♻️ All questions: {all_quests} 🟢 Answered: {answered_quests} ✅ Correct: {correct} ❌ Wrong: {incorrect} ⌛️ Skipp: {skipp} ⏱️ {time}
uz: 🏁 "{topic}" testi yakunlandi. ♻️ Barcha savollar: {all_quests} 🟢 Javob berilgan: {answered_quests} ✅ To‘g‘ri: {correct} ❌ Noto‘g‘ri: {incorrect} ⌛️ O‘tkazib yuborilgan: {skipp} ⏱️ {time}

source: {topic} ⏳ Restart!
uz: {topic} ⏳ Qayta boshlash!

source: Select!
uz: Tanlang!

source: Test pauzed!
uz: Test to‘xtatildi!

source: Begin
uz: Boshlash

source: Get questions file
uz: Savollar faylini olish

source: Check answers
uz: Javoblarni tekshirish

source: View my answers
uz: Mening javoblarimni ko‘rish

source: 🔙 Back
uz: 🔙 Orqaga

source: Test analyses
uz: Test tahlillari

source: Attestation courses
uz: Attestatsiya kurslari

source: Subscribe
uz: Obuna bo‘lish

source: Main menu
uz: Asosiy menyu

source: Certificate courses
uz: Sertifikatli kurslar

source: Back
uz: Orqaga

source: Restart
uz: Qayta boshlash

source: Resume quiz
uz: Testni davom ettirish

source: Stop quiz
uz: Testni to‘xtatish

source: This test is not active!
uz: Bu test faol emas!

source: Please wait for the test start time!
uz: Iltimos, test boshlanish vaqtini kuting!

source: The testing process has begun!
uz: Test jarayoni boshlandi!

source: You have already answered!
uz: Siz allaqachon javob berdingiz!

source: The time to submit answers is over!
uz: Javoblarni topshirish vaqti tugadi!

source: Invalid answers! Try again...
uz: Noto‘g‘ri javoblar! Qaytadan urinib ko‘ring...

source: Your answers have been accepted!
uz: Javoblaringiz qabul qilindi!

source: You haven't sent your answers yet!
uz: Siz javoblaringizni hali yubormadingiz!

source: No diagnostic tests found!
uz: Hech qanday diagnostika testi topilmadi!

source: Choose one of the tests and take the test!
uz: Testlardan birini tanlab, testni boshlang!

source: Choose one of the menus!
uz: Menyulardan birini tanlang!

source: Channels list for subscribe
uz: Obuna bo‘lish uchun kanallar ro‘yxati

source: Channels list not found!
uz: Kanal ro‘yxati topilmadi!

source: Stop
uz: To‘xtatish

source: Next
uz: Keyingi

source: Are you ready?
uz: Tayormisiz?

source: Let's go!
uz: Boshlaymiz!

source: Test started!
uz: Test boshlandi!

source: The test has already started. Stop it with the /stop command.
uz: Test allaqachon boshlandi. /stop buyrug‘i bilan to‘xtating.

source: Test not set
uz: Test belgilanmagan

source: Choose one of the tests for the title...
uz: Sarlavha uchun testlardan birini tanlang...

source: No lessons found!
uz: Darslik topilmadi!

source: Please subscribe to the following channels: Once subscribed, send the /start command again.
uz: Iltimos, quyidagi kanallarga obuna bo‘ling: Obuna bo‘lgach, /start buyrug‘ini qayta yuboring.

source: hour
uz: soat

source: hours
uz: soatlar

source: minute
uz: daqiqa

source: minutes
uz: daqiqalar

source: second
uz: soniya

source: seconds
uz: soniyalar

source: Uzbek
uz: O‘zbekcha

source: English
uz: Inglizcha

source: Russian
uz: Ruscha

source: Search files
uz: Fayllarni qidirish

source: Select an image to embed
uz: Qo‘shish uchun rasmni tanlang

source: Browse for the image you want, then click 'Embed Image' to continue...
uz: Kerakli rasmni tanlang, so‘ng 'Rasm qo‘shish' tugmasini bosing...

source: No images found. Upload images using the 'Image Button' dialog's 'Upload' tab.
uz: Rasm topilmadi. Rasm qo‘shish uchun 'Rasm tugmasi' oynasidagi 'Yuklash' bo‘limidan foydalaning.

source: Images in:
uz: Rasmlar joylashgan joy:

source: Embed Image
uz: Rasm qo‘shish

source: Play Slideshow
uz: Slayd-shou boshlash

source: Pause Slideshow
uz: Slayd-shou to‘xtatish

source: &lsaquo; Previous Photo
uz: &lsaquo; Oldingi rasm

source: Next Photo &rsaquo;
uz: Keyingi rasm &rsaquo;

source: Next &rsaquo;
uz: Keyingi &rsaquo;

source: &lsaquo; Prev
uz: &lsaquo; Oldingi

source: {editor}: Editing failed
uz: {editor}: Tahrirlashda xatolik yuz berdi

source: {editor}: Editing failed: {e}
uz: {editor}: Tahrirlashda xatolik yuz berdi: {e}

source: Aborted!
uz: Bekor qilindi!

source: (Deprecated) {text}
uz: (Eskirgan) {text}

source: Got unexpected extra argument ({args})
uz: Kutilmagan qo‘shimcha argument olindi ({args})

source: DeprecationWarning: The command {name!r} is deprecated.
uz: Ogohlantirish: {name!r} bu buyruq eskirgan.

source: Commands
uz: Buyruqlar

source: Missing command.
uz: Buyruq ko‘rsatilmagan.

source: No such command {name!r}.
uz: Bunday {name!r} buyruq mavjud emas.

source: Value must be an iterable.
uz: Qiymat iteratsiya qilinadigan turda bo‘lishi kerak.

source: Takes {nargs} values but 1 was given.
uz: {nargs} ta qiymat qabul qiladi, ammo 1 ta berildi.

source: env var: {var}
uz: atrof muhit o‘zgaruvchisi: {var}

source: (dynamic)
uz: (dinamik)

source: default: {default}
uz: standart qiymat: {default}

source: required
uz: majburiy

source: %(prog)s, version %(version)s
uz: %(prog)s, versiya %(version)s

source: Show the version and exit.
uz: Versiyani ko‘rsatish va chiqish.

source: Show this message and exit.
uz: Ushbu xabarni ko‘rsatish va chiqish.

source: Error: {message}
uz: Xato: {message}

source: Try '{command} {option}' for help.
uz: Yordam uchun '{command} {option}' ni sinab ko‘ring.

source: Invalid value: {message}
uz: Noto‘g‘ri qiymat: {message}

source: Invalid value for {param_hint}: {message}
uz: {param_hint} uchun noto‘g‘ri qiymat: {message}

source: Missing argument
uz: Argument yetishmayapti

source: Missing option
uz: Parametr yetishmayapti

source: Missing parameter
uz: Parametr yetishmayapti

source: Missing {param_type}
uz: {param_type} yetishmayapti

source: Missing parameter: {param_name}
uz: Parametr yetishmayapti: {param_name}

source: No such option: {name}
uz: Bunday parametr yo‘q: {name}

source: Did you mean {possibility}?
uz: Siz {possibility} ni nazarda tutyapsizmi?

source: unknown error
uz: noma’lum xato

source: Could not open file {filename!r}: {message}
uz: Faylni ochib bo‘lmadi {filename!r}: {message}

source: Usage:
uz: Foydalanish:

source: Argument {name!r} takes {nargs} values.
uz: Argument {name!r} {nargs} ta qiymat oladi.

source: Option {name!r} does not take a value.
uz: Parametr {name!r} qiymat olmaydi.

source: Option {name!r} requires an argument.
uz: Parametr {name!r} argument talab qiladi.

source: Shell completion is not supported for Bash versions older than 4.4.
uz: Bash 4.4 dan eski versiyalarda shell to‘ldirish qo‘llab-quvvatlanmaydi.

source: Couldn't detect Bash version, shell completion is not supported.
uz: Bash versiyasi aniqlanmadi, shell to‘ldirish qo‘llab-quvvatlanmaydi.

source: Repeat for confirmation
uz: Tasdiqlash uchun takrorlang

source: Error: The value you entered was invalid.
uz: Xato: Siz kiritgan qiymat noto‘g‘ri.

source: Error: {e.message}
uz: Xato: {e.message}

source: Error: The two entered values do not match.
uz: Xato: Kiritilgan ikki qiymat mos kelmaydi.

source: Error: invalid input
uz: Xato: noto‘g‘ri kiritish

source: Press any key to continue...
uz: Davom ettirish uchun istalgan tugmani bosing...

source: Choose from: {choices}
uz: Quyidagilardan tanlang: {choices}

source: {value!r} is not {choice}.
uz: {value!r} {choice} emas.

source: {value!r} does not match the format {format}.
uz: {value!r} {format} formatiga mos kelmaydi.

source: {value!r} is not a valid {number_type}.
uz: {value!r} yaroqli {number_type} emas.

source: {value} is not in the range {range}.
uz: {value} {range} oralig‘ida emas.

source: {value!r} is not a valid boolean.
uz: {value!r} to‘g‘ri boolean emas.

source: {value!r} is not a valid UUID.
uz: {value!r} to‘g‘ri UUID emas.

source: file
uz: fayl

source: directory
uz: papka

source: path
uz: yo‘l

source: {name} {filename!r} does not exist.
uz: {name} {filename!r} mavjud emas.

source: {name} {filename!r} is a file.
uz: {name} {filename!r} fayl.

source: {name} {filename!r} is a directory.
uz: {name} {filename!r} papka.

source: {name} {filename!r} is not readable.
uz: {name} {filename!r} o‘qilmaydi.

source: {name} {filename!r} is not writable.
uz: {name} {filename!r} yozilmaydi.

source: {name} {filename!r} is not executable.
uz: {name} {filename!r} bajarilmaydi.

source: {len_type} values are required, but {len_value} was given.
uz: {len_type} qiymatlar talab qilinadi, ammo {len_value} berildi.

source: Messages
uz: Xabarlar

source: Site Maps
uz: Sayt xaritalari

source: Static Files
uz: Statik fayllar

source: Syndication
uz: Sindikatsiya

source: That page number is not an integer
uz: Sahifa raqami butun son emas

source: That page number is less than 1
uz: Sahifa raqami 1 dan kichik

source: That page contains no results
uz: Ushbu sahifada natijalar yo‘q

source: Enter a valid value.
uz: To‘g‘ri qiymat kiriting.

source: Enter a valid URL.
uz: To‘g‘ri URL kiriting.

source: Enter a valid integer.
uz: To‘g‘ri butun son kiriting.

source: Enter a valid email address.
uz: To‘g‘ri email manzil kiriting.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
uz: Faqat harflar, raqamlar, pastki chiziq yoki tiredan tashkil topgan to‘g‘ri 'slug' kiriting.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
uz: Unicode harflar, raqamlar, pastki chiziq yoki tiredan tashkil topgan to‘g‘ri 'slug' kiriting.

source: Enter a valid IPv4 address.
uz: To‘g‘ri IPv4 manzil kiriting.

source: Enter a valid IPv6 address.
uz: To‘g‘ri IPv6 manzil kiriting.

source: Enter a valid IPv4 or IPv6 address.
uz: To‘g‘ri IPv4 yoki IPv6 manzil kiriting.

source: Enter only digits separated by commas.
uz: Faqat vergullar bilan ajratilgan raqamlarni kiriting.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
uz: Qiymat %(limit_value)s ga teng bo‘lishi kerak (hozir %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
uz: Qiymat %(limit_value)s dan kichik yoki teng bo‘lishi kerak.

source: Ensure this value is greater than or equal to %(limit_value)s.
uz: Qiymat %(limit_value)s dan katta yoki teng bo‘lishi kerak.

source: Ensure this value is a multiple of step size %(limit_value)s.
uz: Qiymat %(limit_value)s qadamining ko‘paytmasi bo‘lishi kerak.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
uz: Qiymat kamida %(limit_value)d belgidan iborat bo‘lishi kerak (hozir %(show_value)d).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
uz: Qiymat maksimal %(limit_value)d belgidan iborat bo‘lishi kerak (hozir %(show_value)d).

source: Enter a number.
uz: Raqam kiriting.

source: Ensure that there are no more than %(max)s digit in total.
uz: Jami raqamlar soni %(max)s dan ko‘p bo‘lmasligi kerak.

source: Ensure that there are no more than %(max)s decimal place.
uz: Kasr qismi uzunligi %(max)s dan oshmasligi kerak.

source: Ensure that there are no more than %(max)s digit before the decimal point.
uz: O‘nlik nuqtadan oldingi raqamlar soni %(max)s dan oshmasligi kerak.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
uz: “%(extension)s” kengaytmasi ruxsat etilmagan. Ruxsat etilgan kengaytmalar: %(allowed_extensions)s.

source: Null characters are not allowed.
uz: Null belgilariga ruxsat berilmaydi.

source: and
uz: va

source: %(model_name)s with this %(field_labels)s already exists.
uz: Bunday %(field_labels)s bo‘lgan %(model_name)s allaqachon mavjud.

source: Constraint “%(name)s” is violated.
uz: “%(name)s” cheklovi buzilgan.

source: Value %(value)r is not a valid choice.
uz: %(value)r qiymati to‘g‘ri variant emas.

source: This field cannot be null.
uz: Ushbu maydon bo‘sh bo‘la olmaydi.

source: This field cannot be blank.
uz: Ushbu maydon bo‘sh qoldirilmaydi.

source: %(model_name)s with this %(field_label)s already exists.
uz: Bunday %(field_label)s bo‘lgan %(model_name)s allaqachon mavjud.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
uz: %(field_label)s %(date_field_label)s %(lookup_type)s bo‘yicha noyob bo‘lishi kerak.

source: Field of type: %(field_type)s
uz: Maydon turi: %(field_type)s

source: “%(value)s” value must be either True or False.
uz: “%(value)s” qiymati faqat True yoki False bo‘lishi mumkin.

source: “%(value)s” value must be either True, False, or None.
uz: “%(value)s” qiymati True, False yoki None bo‘lishi mumkin.

source: Boolean (Either True or False)
uz: Boolean (True yoki False)

source: String (up to %(max_length)s)
uz: Matn (eng ko‘p %(max_length)s ta belgi)

source: String (unlimited)
uz: Matn (cheklanmagan)

source: Comma-separated integers
uz: Vergul bilan ajratilgan butun sonlar

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
uz: “%(value)s” qiymatining sana formati noto‘g‘ri. YYYY-MM-DD shaklida bo‘lishi kerak.

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
uz: “%(value)s” qiymati YYYY-MM-DD formatida, lekin noto‘g‘ri sana.

source: Date (without time)
uz: Sana (vaqt ko‘rsatilmagan)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
uz: “%(value)s” qiymatining formati noto‘g‘ri. YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] shaklida bo‘lishi kerak.

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
uz: “%(value)s” qiymati format jihatdan to‘g‘ri, ammo noto‘g‘ri sana/vaqt.

source: Date (with time)
uz: Sana (vaqt bilan)

source: “%(value)s” value must be a decimal number.
uz: “%(value)s” qiymati o‘nlik son bo‘lishi kerak.

source: Decimal number
uz: O‘nlik son

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
uz: “%(value)s” qiymatining formati noto‘g‘ri. [DD] [[HH:]MM:]ss[.uuuuuu] shaklida bo‘lishi kerak.

source: Duration
uz: Davomiylik

source: Email address
uz: Elektron pochta manzili

source: File path
uz: Fayl yo‘li

source: “%(value)s” value must be a float.
uz: “%(value)s” qiymati haqiqiy son (float) bo‘lishi kerak.

source: Floating point number
uz: Haqiqiy son (float)

source: “%(value)s” value must be an integer.
uz: “%(value)s” qiymati butun son bo‘lishi kerak.

source: Integer
uz: Butun son

source: Big (8 byte) integer
uz: Katta (8 bayt) butun son

source: Small integer
uz: Kichik butun son

source: IPv4 address
uz: IPv4 manzili

source: IP address
uz: IP manzili

source: “%(value)s” value must be either None, True or False.
uz: “%(value)s” qiymati None, True yoki False bo‘lishi kerak.

source: Boolean (Either True, False or None)
uz: Boolean (True, False yoki None)

source: Positive big integer
uz: Musbat katta butun son

source: Positive integer
uz: Musbat butun son

source: Positive small integer
uz: Musbat kichik butun son

source: Slug (up to %(max_length)s)
uz: Slug (maksimal uzunligi %(max_length)s)

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
uz: “%(value)s” qiymat noto‘g‘ri formatda. U HH:MM[:ss[.uuuuuu]] formatida bo‘lishi kerak.

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
uz: “%(value)s” qiymat formati to‘g‘ri (HH:MM[:ss[.uuuuuu]]), lekin vaqt noto‘g‘ri.

source: Time
uz: Vaqt

source: Raw binary data
uz: Xom ikkilik ma'lumot

source: “%(value)s” is not a valid UUID.
uz: “%(value)s” yaroqli UUID emas.

source: Universally unique identifier
uz: Umumiy noyob identifikator

source: A JSON object
uz: JSON obyekti

source: Value must be valid JSON.
uz: Qiymat yaroqli JSON bo‘lishi kerak.

source: %(model)s instance with %(field)s %(value)r does not exist.
uz: %(model)s modeli uchun %(field)s %(value)r qiymatli obyekt mavjud emas.

source: Foreign Key (type determined by related field)
uz: Tashqi kalit (bog‘langan maydon turi bo‘yicha)

source: One-to-one relationship
uz: Birga-bir munosabat

source: %(from)s-%(to)s relationship
uz: %(from)s-%(to)s munosabati

source: %(from)s-%(to)s relationships
uz: %(from)s-%(to)s munosabatlari

source: Many-to-many relationship
uz: Ko‘pga-ko‘p munosabat

source: This field is required.
uz: Ushbu maydon to‘ldirilishi shart.

source: Enter a whole number.
uz: Butun son kiriting.

source: Enter a valid date.
uz: Yaroqli sana kiriting.

source: Enter a valid time.
uz: Yaroqli vaqt kiriting.

source: Enter a valid date/time.
uz: Yaroqli sana/vaqt kiriting.

source: Enter a valid duration.
uz: Yaroqli davomiylik kiriting.

source: The number of days must be between {min_days} and {max_days}.
uz: Kunlar soni {min_days} dan {max_days} gacha bo‘lishi kerak.

source: No file was submitted. Check the encoding type on the form.
uz: Hech qanday fayl yuborilmadi. Forma kodlash turini tekshiring.

source: No file was submitted.
uz: Hech qanday fayl yuborilmadi.

source: The submitted file is empty.
uz: Yuborilgan fayl bo‘sh.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
uz: Fayl nomi maksimal %(max)d ta belgidan iborat bo‘lishi kerak (hozir %(length)d).

source: Please either submit a file or check the clear checkbox, not both.
uz: Iltimos, faqat fayl yuboring yoki tozalash katagiga belgi qo‘ying, ikkala bir vaqtning o‘zida emas.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
uz: Yaroqli rasm yuklang. Yuklagan faylingiz rasm emas yoki buzilgan.

source: Select a valid choice. %(value)s is not one of the available choices.
uz: To‘g‘ri variantni tanlang. %(value)s mavjud variantlardan emas.

source: Enter a list of values.
uz: Qiymatlar ro‘yxatini kiriting.

source: Enter a complete value.
uz: To‘liq qiymat kiriting.

source: Enter a valid UUID.
uz: Yaroqli UUID kiriting.

source: Enter a valid JSON.
uz: Yaroqli JSON kiriting.

source: (Hidden field %(name)s) %(error)s
uz: (Yashirilgan maydon %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
uz: ManagementForm ma'lumotlari yo‘q yoki buzilgan. Yo‘qolgan maydonlar: %(field_names)s. Muammo davom etsa xato haqida xabar yuborishingiz kerak bo‘lishi mumkin.
