Repository: shamshod8052/biology_test_bot
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Please submit at most %(num)d form.
uz: Iltimos, maksimal %(num)d ta forma yuboring.

source: Please submit at least %(num)d form.
uz: Iltimos, kamida %(num)d ta forma yuboring.

source: Order
uz: Tartib

source: Delete
uz: O‘chirish

source: Please correct the duplicate data for %(field)s.
uz: %(field)s uchun takrorlangan ma’lumotlarni to‘g‘rilang.

source: Please correct the duplicate data for %(field)s, which must be unique.
uz: %(field)s uchun takrorlangan ma’lumotlarni to‘g‘rilang, u noyob bo‘lishi kerak.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
uz: %(date_field)s da %(lookup)s uchun noyob bo‘lishi kerak bo‘lgan %(field_name)s dagi takrorlangan ma’lumotlarni to‘g‘rilang.

source: Please correct the duplicate values below.
uz: Iltimos, quyidagi takroriy qiymatlarni to‘g‘rilang.

source: The inline value did not match the parent instance.
uz: Ichki qiymat ota instansiya bilan mos kelmadi.

source: Select a valid choice. That choice is not one of the available choices.
uz: To‘g‘ri variantni tanlang. Ushbu variant mavjud tanlovlardan emas.

source: “%(pk)s” is not a valid value.
uz: “%(pk)s” haqiqiy qiymat emas.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
uz: %(datetime)s vaqt mintaqasi %(current_timezone)s da tushunilmadi; u noaniq yoki mavjud emas bo‘lishi mumkin.

source: Clear
uz: Tozalash

source: Currently
uz: Hozirda

source: Change
uz: O‘zgartirish

source: Unknown
uz: Noma’lum

source: Yes
uz: Ha

source: No
uz: Yo‘q

source: yes,no,maybe
uz: ha,yo‘q,balki

source: %(size)d byte
uz: %(size)d bayt

source: midnight
uz: yarim kecha

source: noon
uz: peshin

source: Monday
uz: Dushanba

source: Tuesday
uz: Seshanba

source: Wednesday
uz: Chorshanba

source: Thursday
uz: Payshanba

source: Friday
uz: Juma

source: Saturday
uz: Shanba

source: Sunday
uz: Yakshanba

source: Mon
uz: Du

source: Tue
uz: Se

source: Wed
uz: Cho

source: Thu
uz: Pay

source: Fri
uz: Ju

source: Sat
uz: Sha

source: Sun
uz: Ya

source: January
uz: Yanvar

source: February
uz: Fevral

source: March
uz: Mart

source: April
uz: Aprel

source: June
uz: Iyun

source: July
uz: Iyul

source: August
uz: Avgust

source: September
uz: Sentyabr

source: October
uz: Oktyabr

source: November
uz: Noyabr

source: December
uz: Dekabr

source: jan
uz: yan

source: feb
uz: fev

source: jun
uz: iun

source: jul
uz: iyul

source: aug
uz: avg

source: sep
uz: sen

source: oct
uz: okt

source: nov
uz: noy

source: dec
uz: dek

# abbrev. month
source: Jan.
uz: Yan.

# abbrev. month
source: Feb.
uz: Fev.

# abbrev. month
source: March
uz: Mart

# abbrev. month
source: April
uz: Aprel

# abbrev. month
source: June
uz: Iyun

# abbrev. month
source: July
uz: Iyul

# abbrev. month
source: Aug.
uz: Avg.

# abbrev. month
source: Sept.
uz: Sen.

# abbrev. month
source: Oct.
uz: Okt.

# abbrev. month
source: Nov.
uz: Noy.

# abbrev. month
source: Dec.
uz: Dek.

# alt. month
source: January
uz: Yanvar

# alt. month
source: February
uz: Fevral

# alt. month
source: March
uz: Mart

# alt. month
source: April
uz: Aprel

# alt. month
source: June
uz: Iyun

# alt. month
source: July
uz: Iyul

# alt. month
source: August
uz: Avgust

# alt. month
source: September
uz: Sentyabr

# alt. month
source: October
uz: Oktyabr

# alt. month
source: November
uz: Noyabr

# alt. month
source: December
uz: Dekabr

source: This is not a valid IPv6 address.
uz: Bu haqiqiy IPv6 manzili emas.

source: or
uz: yoki

source: %(num)d year
uz: %(num)d yil

source: %(num)d month
uz: %(num)d oy

source: %(num)d week
uz: %(num)d hafta

source: %(num)d day
uz: %(num)d kun

source: %(num)d hour
uz: %(num)d soat

source: %(num)d minute
uz: %(num)d daqiqa

source: Forbidden
uz: Ruxsat berilmagan

source: CSRF verification failed. Request aborted.
uz: CSRF tekshiruvi muvaffaqiyatsiz yakunlandi. So‘rov bekor qilindi.

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
uz: Ushbu xabarni ko‘rishingizning sababi shundaki, bu HTTPS sayt brauzeringizdan “Referer” sarlavhasini yuborishni talab qiladi, lekin hech narsa yuborilmadi. Ushbu sarlavha xavfsizlik sabablaridan kerak, brauzeringiz uchinchi tomonlar tomonidan egallab olinmasligini ta’minlash uchun.

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
uz: Agar brauzeringizni “Referer” sarlavhalarini o‘chirib qo‘yish uchun sozlagan bo‘lsangiz, iltimos, ularni kamida ushbu sayt uchun, yoki HTTPS ulanishlari, yoki “bir xil manba” so‘rovlar uchun qayta yoqing.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
uz: Agar siz <meta name="referrer" content="no-referrer"> tegi yoki “Referrer-Policy: no-referrer” sarlavhasini ishlatayotgan bo‘lsangiz, iltimos, ularni olib tashlang. CSRF himoyasi qat’iy referer tekshiruvi uchun “Referer” sarlavhasini talab qiladi. Maxfiylik haqida xavotirda bo‘lsangiz, uchinchi tomon saytlarga havolalar uchun <a rel="noreferrer" …> kabi alternativalardan foydalaning.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
uz: Ushbu xabarni ko‘rishingizning sababi — ushbu sayt formalarni yuborishda CSRF cookie talab qiladi. Ushbu cookie xavfsizlik uchun kerak, brauzeringizning uchinchi tomonlar tomonidan egallanmasligini ta’minlash maqsadida.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
uz: Agar brauzeringizni cookie’larni o‘chirib qo‘yish uchun sozlagan bo‘lsangiz, iltimos, ularni kamida ushbu sayt yoki “bir xil manba” so‘rovlari uchun qayta yoqing.

source: More information is available with DEBUG=True.
uz: Batafsil ma’lumotni olish uchun DEBUG=True holatini yoqing.

source: No year specified
uz: Yil ko‘rsatilmagan

source: Date out of range
uz: Sana diapazondan tashqarida

source: No month specified
uz: Oy ko‘rsatilmagan

source: No day specified
uz: Kun ko‘rsatilmagan

source: No week specified
uz: Hafta ko‘rsatilmagan

source: No %(verbose_name_plural)s available
uz: %(verbose_name_plural)s mavjud emas

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
uz: Kelajakdagi %(verbose_name_plural)s mavjud emas, chunki %(class_name)s.allow_future qiymati False.

source: Invalid date string “%(datestr)s” given format “%(format)s”
uz: Noto‘g‘ri sana satri “%(datestr)s”, berilgan format “%(format)s”

source: No %(verbose_name)s found matching the query
uz: So‘rovga mos keladigan %(verbose_name)s topilmadi

source: Page is not “last”, nor can it be converted to an int.
uz: Sahifa “oxirgi” emas va butun songa aylantirib bo‘lmaydi.

source: Invalid page (%(page_number)s): %(message)s
uz: Noto‘g‘ri sahifa (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
uz: Ro‘yxat bo‘sh va “%(class_name)s.allow_empty” qiymati False.

source: Directory indexes are not allowed here.
uz: Bu yerda papka indekslari ruxsat etilmagan.

source: “%(path)s” does not exist
uz: “%(path)s” mavjud emas

source: Index of %(directory)s
uz: %(directory)s papkasining indeksi

source: The install worked successfully! Congratulations!
uz: O‘rnatish muvaffaqiyatli bajarildi! Tabriklaymiz!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
uz: Django %(version)s uchun <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">chiqarilgan yangiliklar</a>ni ko‘ring

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
uz: Ushbu sahifani ko‘rayapsiz, chunki sozlamalaringizda <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> faol va hech qanday URL sozlanmagan.

source: Django Documentation
uz: Django hujjatlari

source: Topics, references, &amp; how-to’s
uz: Mavzular, manbalar va qo‘llanmalar

source: Tutorial: A Polling App
uz: Qo‘llanma: So‘rovnoma ilovasi

source: Get started with Django
uz: Djangoda boshlang‘ich

source: Django Community
uz: Django jamoasi

source: Connect, get help, or contribute
uz: Bog‘laning, yordam oling yoki hissa qo‘shing

source: A short UUID field.
uz: Qisqa UUID maydoni.
